In [1]:
#Load the magic %load_ext sql
%load_ext sql

In [2]:
# connect sqlite. the below command is like a Sqlite engine terminal.
%sql sqlite://

'Connected: @None'

In [3]:
# Connection is done. We will create a table called 'contacts'.
%%sql CREATE TABLE contacts(
    contact_id INTEGER PRIMARY KEY,
    first_name TEXT NOT NULL,
    last_name TEXT NOT NULL,
    email TEXT NOT NULL UNIQUE,
    phone INTEGER NOT NULL UNIQUE
);

 * sqlite://
Done.

[]

In [4]:
# Insert few rows in the table 'contacts'
%sql INSERT INTO contacts VALUES(100,'Donald','Duck','donaldo@aol.com', 123456);
%sql INSERT INTO contacts VALUES(102,'Black','Panther','panther@yahoo.com', 987654);
%sql INSERT INTO contacts VALUES(104,'Bat','Man','batty@dark.com', 211002);

 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.

[]

In [5]:
#Let us print all the rows in the table.
%sql SELECT * FROM contacts;

 * sqlite://
Done.

[(100, 'Donald', 'Duck', 'donaldo@aol.com', 123456),
 (102, 'Black', 'Panther', 'panther@yahoo.com', 987654),
 (104, 'Bat', 'Man', 'batty@dark.com', 211002)]

In [12]:
# We will read the sql data into Python dataframe object.
import pandas as pd

output = %sql SELECT * from contacts;
df=pd.DataFrame(output)
print("Dataframe object type:",type(df))
print(df)

 * sqlite://
Done.
Dataframe object type: <class 'pandas.core.frame.DataFrame'>
     0       1        2                  3       4
0  100  Donald     Duck    donaldo@aol.com  123456
1  102   Black  Panther  panther@yahoo.com  987654
2  104     Bat      Man     batty@dark.com  211002